Autodesk.Revit.DB.PointOnEdgeFaceIntersection.OrientWithEdge
Whether to orient the ReferencePoint to the edge or the face.
Remarks: If true, the X basis vector will be parallel to the edge.
If false, the X and Y basis vectors will be parallel to the face.

Autodesk.Revit.DB.PointOnEdgeFaceIntersection.SetFaceReference(Autodesk.Revit.DB.Reference)
Change the face reference.
Remarks: The referenced element may be any model element, including
FamilyInstance or FormElement. The reference
must be of type ElementReferenceType.REFERENCE_TYPE_SURFACE,
and the surface must be of type Autodesk.Revit.DB.Plane.
The Reference's UVPoint property is ignored.

Autodesk.Revit.DB.PointOnEdgeFaceIntersection.GetFaceReference
Get a copy of the face reference.

Autodesk.Revit.DB.PointOnEdgeFaceIntersection.SetEdgeReference(Autodesk.Revit.DB.Reference)
Change the edge or curve reference.
Remarks: The referenced element may be any model element, including
FamilyInstance, FormElement, or CurveElement. The reference
must be of type ElementReferenceType.REFERENCE_TYPE_LINEAR.

Autodesk.Revit.DB.PointOnEdgeFaceIntersection.GetEdgeReference
Get a copy of the edge or curve reference.

Autodesk.Revit.DB.PointOnEdgeFaceIntersection
Define a ReferencePoint at the intersection of a referenceable
edge or curve and a referenceable face.
Remarks: The ReferencePoint's orientation is partially constrained
either to the edge (in the manner of PointOnEdge) or to the face
(in the manner of PointOnFace).